# Lightweight Brewfile
cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

# Core
brew 'make'
brew 'coreutils'  # pre-requisite for asdf

# Core Tools
brew 'git'
brew 'tig'
brew 'vim'
brew 'tmux'
brew 'lynx'
brew 'sqlite'
brew 'ncurses'
brew 'fzf'
brew 'm4'

# Other tools
brew 'recutils'
brew 'tectonic' # Tex
brew 'aspell'
brew 'pandoc'

# C++ libs
brew 'boost'
# brew 'clang-format'
# brew 'cmake'

# HPC 
# brew 'open-mpi'
brew 'libomp'

# Core Libs
brew 'libiconv'
brew 'libffi'
brew 'libtool'
brew 'libyaml'
brew 'openssl', link: true
brew 'readline'
brew 'zlib', link: true
brew 'wget'

# Utils
brew 'direnv'
brew 'ripgrep'
brew 'asdf'
brew 'gpg'

# Casks
#cask 'zoom'
cask 'chromium'
cask 'keepassx'
cask 'keybase'
cask 'vscodium'
cask 'mpv'
